In [2]:
import numpy as np

In [15]:
np.random.seed(57) 

a = np.random.randint(1,20,5)
a

array([16,  6, 16,  3,  9])

# Pandas ====>  open-source library that is used for handle data manipulations .

# Data Structure of Pandas ===> 
(1). Series  =====> it is used for one dimensional data . It shows only values of a column and it will not include column name . 

(2). DataFrame ====> It is multi-dimensiuonal data . It shows column name with values .

In [16]:
import pandas as pd

In [17]:
a = pd.Series([1,34,78,90])
a

0     1
1    34
2    78
3    90
dtype: int64

In [18]:
type(a)

pandas.core.series.Series

# (2). DataFrame ====>

In [23]:
a = {
    "Emp_ID" : [1,2,3,4,5,6,7,8] , 
    "Name" : ['Sam' , 'Rahul' , 'Gorav' , 'Aniket' , 'Anjali' , 'Ria' , 'Muskan','Harsh'],
    "Department" : ['IT' ,'HR' , 'Sales' , 'IT' , 'IT' , 'Sales', 'IT' , 'HR'],
    "Salary" : [25000 , 27000 , 23000 , 30000 , 35000 , 32000 , 28000 , 31000],
    "Working_hours" : [8,9,8,9,7,6,7,8]
}

In [24]:
type(a)

dict

In [25]:
df = pd.DataFrame(a) 
df

   Emp_ID    Name Department  Salary  Working_hours
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3   Gorav      Sales   23000              8
3       4  Aniket         IT   30000              9
4       5  Anjali         IT   35000              7
5       6     Ria      Sales   32000              6
6       7  Muskan         IT   28000              7
7       8   Harsh         HR   31000              8

# How to check top 5 data from a dataframe ?

In [26]:
df.head()

   Emp_ID    Name Department  Salary  Working_hours
0       1     Sam         IT   25000              8
1       2   Rahul         HR   27000              9
2       3   Gorav      Sales   23000              8
3       4  Aniket         IT   30000              9
4       5  Anjali         IT   35000              7

In [27]:
df.head(2)

   Emp_ID   Name Department  Salary  Working_hours
0       1    Sam         IT   25000              8
1       2  Rahul         HR   27000              9

# How to check bottom data ?

In [28]:
df.tail()

   Emp_ID    Name Department  Salary  Working_hours
3       4  Aniket         IT   30000              9
4       5  Anjali         IT   35000              7
5       6     Ria      Sales   32000              6
6       7  Muskan         IT   28000              7
7       8   Harsh         HR   31000              8

In [29]:
df.tail(3)

   Emp_ID    Name Department  Salary  Working_hours
5       6     Ria      Sales   32000              6
6       7  Muskan         IT   28000              7
7       8   Harsh         HR   31000              8

In [30]:
df.tail(2)

   Emp_ID    Name Department  Salary  Working_hours
6       7  Muskan         IT   28000              7
7       8   Harsh         HR   31000              8

# How can we check random indexed data ?

In [31]:
df.sample(3)

   Emp_ID    Name Department  Salary  Working_hours
2       3   Gorav      Sales   23000              8
6       7  Muskan         IT   28000              7
4       5  Anjali         IT   35000              7

# How to export our data  ?

In [32]:
df.to_csv("C:\\Users\\saurabh\\Desktop\\atg\\Emp_Info.csv")

In [ ]:
# step-1 (df.to_csv(" ")) 

# step-2  Create a new folder ==> copy location ===> paste it into step-1 
# df.to_csv("folder_location\\filename.csv")